outputs/openfoam_cases/0000/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            1.82;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  2.64;
    Tp                  9.92;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
6.18496e-91
7.97516e-77
2.71969e-65
8.52378e-56
6.36179e-48
2.35784e-41
7.69129e-36
3.46143e-31
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0289365
0.0300948
0.0312526
0.0324096
0.0335653
0.0347196
0.0358722
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        3.03983e-40
        1.77494e-34
        9.93418e-30
        8.57909e-26
        1.65078e-22
        9.42235e-20
        1.99739e-17
        1.87879e-15
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0283571
        0.0295157
        0.0306737
        0.0318311
        0.0329874
        0.0341425
        0.0352959
        0.0364474
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0152657 0 0)
        (0.0158995 0 0)
        (0.0165344 0 0)
        (0.0171701 0 0)
        (0.0178066 0 0)
        (0.0184438 0 0)
        (0.0190815 0 0)
        (0.0197197 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
